tutorials/interDyMFoam/sloshingTank3D/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

m4 constant/polyMesh/blockMeshDict.m4 > constant/polyMesh/blockMeshDict
runApplication blockMesh
cp 0/gamma.org 0/gamma
runApplication setFields
runApplication interDyMFoam
